package Big_Homework.part3;
// Читачі бібліотеки
// а) Визначити клас Reader, який зберігає таку інформацію про користувача бібліотеки: ПІБ, номер квитка читача, телефон.
//
// б) Додати методи takeBooks(), returnBooks().
//
// - takeBooks() прийматиме два параметри: кількість книг, які вже взяв читач, і кількість книг, які бере читач зараз.
// Цей метод буде виводити запис у форматі. "Читач Петров взяв сьогодні n книг. Загалом читач взяв "загальна сумма" книг."
// Опрацювати кейс, коли читач взяв більше ніж 5 книг. За це нарахувати штраф (кожна книжка, яка перевищує ліміт = 50 грн).
// В даному випадку вивести в консоль повідомлення з текстом "Ліміт перевищенний. Сума штрафу = n грн"
//
// -returnBooks() прийматиме два параметри: кількість книг, які вже взяв читач, і кількість книг, які повертає читач зараз.
// Цей метод буде виводити в консоль запис у форматі. "Читач Петров повернув сьогодні книг.
// Загалом в читача залишається  загальна сумма книг." Опрацювати кейс, коли в читача було (тобто перед повернення)
// більше 5 книг і нарахувати за це штраф як і в першому випадку,
// але також нарахувати майбутній штраф, якщо після повернення в читача
// залишиться більше 5 книг і вивести про це попередження в консоль.

public class TestPhone {
    public static void main(String[] args) {
        Phone p1 = new Phone(123564364, "Sumsung", 101.5);
        Phone p2 = new Phone(321543545, "Redmi", 102.5);
        Phone p3 = new Phone(345656565, "LG", 103.5);
        System.out.println(p1);
        System.out.println(p2);
        System.out.println(p3);
        p1.receiveCall("Grenor");
        p1.getNumber(32443656);
        p2.receiveCall("Petro");
        p2.getNumber(25346345);
        p3.receiveCall("Sveta");
        p3.getNumber(23434656);
        p1.toString();
    }
}
